Revit 2027 API
BuiltInFailures.StructuralConnectionFailures.StructuralConnectionTypeInfoNotAvailable Property
 There is no add-on installed which supports Structural Connection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StructuralConnectionTypeInfoNotAvailable { get; }
Public Shared ReadOnly Property StructuralConnectionTypeInfoNotAvailable As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StructuralConnectionTypeInfoNotAvailable {
	FailureDefinitionId^ get ();
}
static member StructuralConnectionTypeInfoNotAvailable : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StructuralConnectionFailures Class
Autodesk.Revit.DB Namespace